In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                 'key2':['one','two','one','two','one'],
                 'data1':np.random.randn(5),
                 'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.393845  0.165734
1    a  two -2.623130 -1.755574
2    b  one -0.540862 -0.283449
3    b  two -0.256168  0.133023
4    a  one  1.248378  0.273814

In [3]:
grouped = df['data1'].groupby(df['key1'])#根据分组键df['key1']分组，访问data1数据
grouped  #变量grouped是一个GroupBy对象。它实际上还没有进行任何计算，只是含有一些有关分组键df['key1']的中间数据而已。

In [4]:
grouped.mean()   #GroupBy的mean方法来计算分组平均值

key1
a   -0.326969
b   -0.398515
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()#根据2个分组键分组，访问ata1数据，然后进行聚合运算
means

key1  key2
a     one     0.821111
      two    -2.623130
b     one    -0.540862
      two    -0.256168
Name: data1, dtype: float64

In [6]:
means.unstack()# 换下索引

key2       one       two
key1
a     0.821111 -2.623130
b    -0.540862 -0.256168

In [7]:
df.groupby('key1').mean()#分组后得到是一个groupby对象，经行聚合运算后得到结果，指定访问数据时，分组键不能为列名

         data1     data2
key1
a    -0.326969 -0.438675
b    -0.398515 -0.075213

In [8]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.821111  0.219774
     two  -2.623130 -1.755574
b    one  -0.540862 -0.283449
     two  -0.256168  0.133023

In [9]:
df.groupby(['key1', 'key2']).size() #各分组的大小

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [10]:
for name, group in df.groupby('key1'):#迭代产生二元元组（str,dataframe）,分组名和数据块组成
    print(name)   
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.393845  0.165734
1    a  two -2.623130 -1.755574
4    a  one  1.248378  0.273814
b
  key1 key2     data1     data2
2    b  one -0.540862 -0.283449
3    b  two -0.256168  0.133023

In [11]:
for (k1, k2), group in df.groupby(['key1', 'key2']):#对于多重键的情况，元组的第一个元素将会是由键值组成的元组
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.393845  0.165734
4    a  one  1.248378  0.273814
('a', 'two')
  key1 key2    data1     data2
1    a  two -2.62313 -1.755574
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.540862 -0.283449
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.256168  0.133023

In [12]:
list(df.groupby('key1')) #将分组后转化为列表

[('a',
    key1 key2     data1     data2
  0    a  one  0.393845  0.165734
  1    a  two -2.623130 -1.755574
  4    a  one  1.248378  0.273814),
 ('b',
    key1 key2     data1     data2
  2    b  one -0.540862 -0.283449
  3    b  two -0.256168  0.133023)]

In [13]:
dict(list(df.groupby('key1')))#将分组后转化为字典

{'a':   key1 key2     data1     data2
 0    a  one  0.393845  0.165734
 1    a  two -2.623130 -1.755574
 4    a  one  1.248378  0.273814,
 'b':   key1 key2     data1     data2
 2    b  one -0.540862 -0.283449
 3    b  two -0.256168  0.133023}

In [14]:
#除了对行进行数据分组处理，我们还可以对列进行分组，可以把值列和对象列等不同类型分出来整理查看
#由于分组后返回的是一个groupby对象，要查看需要进行迭代处理
df.dtypes  #查看有多少类型

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [15]:
grouped = df.groupby(df.dtypes, axis=1)  #对类型进行分组，在列上进行分组

In [16]:
#迭代查看分组情况
for i,l in grouped:  #同样为(str,dataframe)
    print(i)
    print(l)

float64
      data1     data2
0  0.393845  0.165734
1 -2.623130 -1.755574
2 -0.540862 -0.283449
3 -0.256168  0.133023
4  1.248378  0.273814
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

选取一列或列的子集

In [17]:
#对于由DataFrame产生的GroupBy对象，如果用一个（单个字符串）或一组（字符串数组）列名对其进行索引，就能实现选取部分列进行聚合的目的
list(df.groupby('key1')['data1'])#先按照key1分组，然后索引出data1数据。该方式是下面窗口代码的语法糖

[('a',
  0    0.393845
  1   -2.623130
  4    1.248378
  Name: data1, dtype: float64),
 ('b',
  2   -0.540862
  3   -0.256168
  Name: data1, dtype: float64)]

In [18]:
list(df['data1'].groupby(df['key1']))#先访问data1数据，然后按照key1分组键分组。

[('a',
  0    0.393845
  1   -2.623130
  4    1.248378
  Name: data1, dtype: float64),
 ('b',
  2   -0.540862
  3   -0.256168
  Name: data1, dtype: float64)]

In [19]:
df.groupby('key1')['data1'].mean()#对data1列进行聚合运算

key1
a   -0.326969
b   -0.398515
Name: data1, dtype: float64

通过字典或者Series经行分组

In [20]:
people = pd.DataFrame(np.random.randn(5,5),columns = ['数学','英语','语文','物理','化学'],
                     index = ['joe','tom','steve','jim','wes'])
people.iloc[2,[1,2]] = np.nan
people

             数学        英语        语文        物理        化学
joe   -1.581300  0.664709 -1.629317 -1.991990 -1.732929
tom    1.319274 -0.624081 -1.299680  0.091252  0.358037
steve -2.072063       NaN       NaN  0.869080  0.514298
jim   -1.088880  0.138568 -0.637318  0.105583 -0.332694
wes    0.323581  0.021506  0.039574  0.006268 -0.852899

In [21]:
mapping = {'数学':'主科','语文':'主科','英语':'主科','物理':'副科','化学':'副科'}#构造字典，把想合并的合并在一起
grade = people.groupby(mapping,axis = 1)  #可以将这个字典传给groupby，来构造数组，也可以直接传递字典
grade.sum()

             主科        副科
joe   -2.545908 -3.724919
tom   -0.604488  0.449289
steve -2.072063  1.383378
jim   -1.587630 -0.227111
wes    0.384661 -0.846632

In [22]:
people.groupby(mapping,axis = 1).count()#分组后每组的数据大小

       主科  副科
joe     3   2
tom     3   2
steve   1   2
jim     3   2
wes     3   2

In [23]:
map_series = pd.Series(mapping)#Series也有同样的功能，它可以被看做一个固定大小的映射
grade = people.groupby(map_series,axis = 1)
grade.sum()

             主科        副科
joe   -2.545908 -3.724919
tom   -0.604488  0.449289
steve -2.072063  1.383378
jim   -1.587630 -0.227111
wes    0.384661 -0.846632

通过函数进行分组

In [24]:
people.groupby(len).sum()# 这里len按默认行索引，字符串长度进行合并分组

         数学        英语        语文        物理        化学
3 -1.027325  0.200702 -3.526741 -1.788887 -2.560485
5 -2.072063  0.000000  0.000000  0.869080  0.514298

In [25]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()#将函数跟数组、列表、字典、Series混合使用也不是问题

             数学        英语        语文        物理        化学
3 one -1.581300 -0.624081 -1.629317 -1.991990 -1.732929
  two -1.088880  0.021506 -0.637318  0.006268 -0.852899
5 one -2.072063       NaN       NaN  0.869080  0.514298

根据索引级别分组

In [26]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                [1, 3, 5, 1, 3]],
                               names=['cty', 'tenor'])#构建多重索引
c_df = pd.DataFrame(np.random.randn(3,5),columns = columns )
c_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.365212  0.410816 -0.580616 -0.269060  0.467603
1     -0.393319 -0.051836 -0.084137 -1.314210  0.017694
2      0.498465 -0.861993 -0.876516  0.368885 -1.153842

In [27]:
#根据级别分组，使用level关键字传递级别序号或名字
c_df.groupby(level = 'cty',axis = 1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3

# 数据聚合

In [28]:
df

  key1 key2     data1     data2
0    a  one  0.393845  0.165734
1    a  two -2.623130 -1.755574
2    b  one -0.540862 -0.283449
3    b  two -0.256168  0.133023
4    a  one  1.248378  0.273814

In [29]:
df.groupby('key1')['data1'].quantile(0.5)  #分组后Series列的样本分位数

key1
a    0.393845
b   -0.398515
Name: data1, dtype: float64

In [30]:
def peak_to(arr):
    return arr.max() - arr.min()
grouped = df.groupby('key1')['data1']
grouped.agg(peak_to)   #分组会后的，同组执行最大值减去最小值
#自定义聚合函数要比那些经过优化的函数慢得多。
#这是因为在构造中间分组数据块时存在非常大的开销（函数调用、数据重排等）。

key1
a    3.871508
b    0.284693
Name: data1, dtype: float64

In [31]:
grouped.describe()

,count,mean,std,min,25%,50%,75%,max
key1,,,,,,,,
a,3.0,-0.326969,2.033918,-2.623130,-1.114643,0.393845,0.821111,1.248378
b,2.0,-0.398515,0.201309,-0.540862,-0.469688,-0.398515,-0.327342,-0.256168

面向列的多函数应用

In [32]:
tips = pd.read_csv('examples/tips.csv')
tips[:]

     total_bill   tip smoker   day    time  size
0         16.99  1.01     No   Sun  Dinner     2
1         10.34  1.66     No   Sun  Dinner     3
2         21.01  3.50     No   Sun  Dinner     3
3         23.68  3.31     No   Sun  Dinner     2
4         24.59  3.61     No   Sun  Dinner     4
..          ...   ...    ...   ...     ...   ...
239       29.03  5.92     No   Sat  Dinner     3
240       27.18  2.00    Yes   Sat  Dinner     2
241       22.67  2.00    Yes   Sat  Dinner     2
242       17.82  1.75     No   Sat  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]

In [33]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [34]:
tips['tip_pct'].mean()  #卧槽，美国小费好高啊，平均都要给到消费的16%

0.16080258172250472

In [35]:
grouped = tips.groupby(['day','smoker',])#更根据抽烟情况和日期情况进行分组
grouped['tip_pct'].mean()

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [36]:
grouped['tip_pct'].agg('mean') #在描述统计，经过优化的函数可以字符串的形式传入，为上面的那个语法糖
#但是这种方法只能传一个，要传多个函数，需要才下面的代码

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [37]:
grouped_pct = grouped['tip_pct']
grouped_pct.agg(['mean', 'std', peak_to])#按照函数进行聚合运算

                 mean       std   peak_to
day  smoker
Fri  No      0.151650  0.028123  0.067349
     Yes     0.174783  0.051293  0.159925
Sat  No      0.158048  0.039767  0.235193
     Yes     0.147906  0.061375  0.290095
Sun  No      0.160113  0.042347  0.193226
     Yes     0.187250  0.154134  0.644685
Thur No      0.160298  0.038774  0.193350
     Yes     0.163863  0.039389  0.151240

In [45]:
functions = ['count', 'mean', 'max']
grouped['tip_pct', 'total_bill'].agg(functions)

C:\Users\YU\AppData\Local\Temp\ipykernel_764\3856822615.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  grouped['tip_pct', 'total_bill'].agg(functions)

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [46]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})#一个列或不同的列应用不同的函数。具体的办法是向agg传入一个从列名映射到函数的字典

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [52]:
tips.groupby(['day', 'smoker'],as_index=False).mean()#以“没有行索引”的形式返回聚合数据

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

# apply：一般性的“拆分－应用－合并”

In [78]:
def top(a,n= 5,column = 'tip_pct'):
    return a.sort_values(by = column)[-n:]#给column列索引下的数据排序，[-5:]取后5行,
top(tips)

     total_bill   tip smoker  day    time  size   tip_pct
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [79]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [82]:
tips.groupby(['day']).apply(top, n=1, column = 'total_bill')

          total_bill    tip smoker   day    time  size   tip_pct
day
Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

禁止分组键

In [83]:
# 分组键会跟原始对象的索引共同构成结果对象中的层次化索引。将group_keys=False传入groupby即可禁止该效果

In [86]:
states = ['Ohio', 'New York', 'Vermont', 'Florida','Oregon', 'Nevada', 'California', 'Idaho']
data = pd.Series(np.random.randn(8), index=states)
group_key = ['East'] * 4 + ['West'] * 4

In [93]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio          0.525156
New York      1.023826
Vermont            NaN
Florida      -0.246283
Oregon       -0.111848
Nevada             NaN
California    0.349428
Idaho              NaN
dtype: float64

In [94]:
data.groupby(group_key).mean()#分组平均值

East    0.434233
West    0.118790
dtype: float64

In [95]:
 fill_mean = lambda g: g.fillna(g.mean())#分组平均值去填充NA值
data.groupby(group_key).apply(fill_mean)

Ohio          0.525156
New York      1.023826
Vermont       0.434233
Florida      -0.246283
Oregon       -0.111848
Nevada        0.118790
California    0.349428
Idaho         0.118790
dtype: float64